Tekla Open API Reference for Tekla Structures 2025
Operation.CreateNCFilesFromSelected Method
Overload List
Name | Description
CreateNCFilesFromSelected(String, String)
 Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
CreateNCFilesFromSelected(String, String, Boolean, String, Boolean, String)
 Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace